ka2_2024/src/DataProcessors/ПомощникЗаполненияЗаявленияНаПолучениеПатента/ПомощникЗаполненияЗаявленияНаПолучениеПатента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПомощникЗаполненияЗаявленияНаПолучениеПатента</name>
  <attributes>
    <name>НаименованиеВидаДеятельности</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодРегиона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорядковыйНомерВидаДеятельности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодВидаДеятельности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоСотрудников</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНалога</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НормаЗакона</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодНалоговогоОргана</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Объекты</name>
    <attributes>
      <name>ВидОбъекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакОбъекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Площадь</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>8</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресСтрокой</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Адреса</name>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресСтрокой</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТранспортныеСредства</name>
    <attributes>
      <name>Номер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Марка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РегистрационныйЗнак</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Грузоподъемность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

ka2_2024/src/DataProcessors/ПомощникЗаполненияЗаявленияНаПолучениеПатента/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Выполняет формирование документа "Уведомление о спецрежимах налогообложения"
//
// Параметры:
//	ПараметрыВыполнения - Структура - с реквизитами Помощника заполнения заявления на получение патента;
//	АдресРезультата - Строка - хранит адрес для помещения результата во временное хранилище.
//
// Возвращаемое значение:
//  ДокументСсылка.УведомлениеОСпецрежимахНалогообложения
//
Функция СформироватьЗаявлениеНаПолучениеПатента(ПараметрыВыполнения, АдресРезультата = Неопределено) Экспорт
	
	СведенияОбОрганизации = СведенияОбИндивидуальномПредпринимателе(
		ПараметрыВыполнения.Организация, ПараметрыВыполнения.ДатаСоставления);
	
	КодНОУчет = СведенияОбОрганизации.КодНО;
	
	ПараметрыКодаНО = НовыеПараметрыЗаполненияКодНалоговогоОргана();
	ЗаполнитьЗначенияСвойств(ПараметрыКодаНО, ПараметрыВыполнения);
	ПараметрыКодаНО.КодНалоговогоОрганаИП = ПараметрыВыполнения.КодНалоговогоОргана;
	
	КодНалоговогоОргана = КодНалоговогоОрганаПатента(ПараметрыКодаНО, КодНОУчет);
	
	ПараметрыЗаявления = Новый Структура;
	Для Каждого ТекПараметр Из ПараметрыВыполнения Цикл
		Если ТипЗнч(ТекПараметр.Значение) <> Тип("ТаблицаЗначений") Тогда
			ПараметрыЗаявления.Вставить(ТекПараметр.Ключ, ТекПараметр.Значение);
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыЗаявления.Вставить("Стр01",  ДанныеЛистаТитульнаяСтраница(ПараметрыВыполнения, СведенияОбОрганизации, КодНалоговогоОргана));
	ПараметрыЗаявления.Вставить("Стр02",  ДанныеЛиста2(ПараметрыВыполнения));
	ПараметрыЗаявления.Вставить("ЛистыА", ДанныеЛистаА(ПараметрыВыполнения, КодНалоговогоОргана));
	ПараметрыЗаявления.Вставить("ЛистыБ", ДанныеЛистаБ(ПараметрыВыполнения, КодНалоговогоОргана, КодНОУчет));
	ПараметрыЗаявления.Вставить("ЛистыВ", ДанныеЛистаВ(ПараметрыВыполнения, КодНалоговогоОргана, КодНОУчет));
	ПараметрыЗаявления.Вставить("РегистрацияВИФНС",
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыВыполнения.Организация, "РегистрацияВНалоговомОргане"));
	
	ПредставительУказан = ЗначениеЗаполнено(ПараметрыВыполнения.Представитель);
	Если ПредставительУказан И ТипЗнч(ПараметрыВыполнения.Представитель) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		ДополнитьСтруктуруФИОПодписанта(ПараметрыВыполнения.Представитель, ПараметрыЗаявления);
	ИначеЕсли ПредставительУказан Тогда
		
		ДополнитьСтруктуруФИОПодписанта(ПараметрыВыполнения.Представитель, ПараметрыЗаявления);
		
	Иначе
		ДополнитьСтруктуруФИОПодписанта("", ПараметрыЗаявления);
	КонецЕсли;
	
	ЗаявлениеНаПатент = НайтиЗаявлениеНаПолучениеПатента(ПараметрыВыполнения);
	
	ПараметрыВыполнения.Вставить("ИмяПомощника", Метаданные.Обработки.ПомощникЗаполненияЗаявленияНаПолучениеПатента.Имя);
	ПараметрыЗаявления.Вставить("ДанныеПомощникаЗаполнения", ПараметрыВыполнения);
	
	Если ЗаявлениеНаПатент = Неопределено Или Не ЗначениеЗаполнено(ЗаявлениеНаПатент.Ссылка) Тогда
		ДокументСсылка = Отчеты.РегламентированноеУведомлениеПолучениеПатента.СформироватьНовоеУведомление(
			ЗаявлениеНаПатент.РедакцияФормы, ПараметрыЗаявления);
	Иначе
		ОбновитьТекущийДокумент(ЗаявлениеНаПатент.Ссылка, ЗаявлениеНаПатент.РедакцияФормы, ПараметрыЗаявления);
		ДокументСсылка = ЗаявлениеНаПатент.Ссылка;
	КонецЕсли;
	
	Если АдресРезультата <> Неопределено Тогда
		ПоместитьВоВременноеХранилище(ДокументСсылка, АдресРезультата);
	КонецЕсли;
	
	Возврат ДокументСсылка;
	
КонецФункции

// Возвращает данные о последнем созданном заявлении
//
// Параметры:
//   ПараметрыВыполнения - Структура - с возможными ключами: Организация, СсылкаНаДокумент, ИмяФормы, СоздатьНовоеУведомление
//
// Возвращаемое значение:
//  Структура:
//     - Дата - Дата (Если документ не был ранее создан, тогда пустая дата)
//     - Ссылка - ДокументСсылка.УведомлениеОСпецрежимахНалогообложения - Если документ не был ранее создан, тогда Неопределено
//     - ИмяФормы - Строка - (напр., Отчет.РегламентированноеУведомлениеПолучениеПатента.Форма.Форма2017_1)
//     - РедакцияФормы - Строка - (напр., Форма2020_1) - редакция формы заявления
//
Функция НайтиЗаявлениеНаПолучениеПатента(ПараметрыВыполнения) Экспорт
	
	Организация = ПараметрыВыполнения.Организация;
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ЗаявлениеПатент = Новый Структура;
	
	СсылкаНаОбъект = Неопределено;
	Если ПараметрыВыполнения.Свойство("СсылкаНаДокумент", СсылкаНаОбъект) Тогда
		ЗаявлениеПатент.Вставить("Ссылка", СсылкаНаОбъект);
		ЗаявлениеПатент.Вставить("ИмяФормы", ПараметрыВыполнения.ИмяФормы);
		ЗаявлениеПатент.Вставить("РедакцияФормы", РедакцияФормыЗаявления(ПараметрыВыполнения.ИмяФормы));
		Возврат ЗаявлениеПатент;
	КонецЕсли;
	
	ИмяФормыПоУмолчанию = Отчеты.РегламентированноеУведомлениеПолучениеПатента.ПолучитьФормуПоУмолчанию();
	РедакцияФормыПоУмолчанию = РедакцияФормыЗаявления(ИмяФормыПоУмолчанию);
	
	ЗаявлениеПатент.Вставить("Дата", Дата(1, 1, 1));
	ЗаявлениеПатент.Вставить("Ссылка", Неопределено);
	
	ЗаявлениеПатент.Вставить("ИмяФормы", ИмяФормыПоУмолчанию);
	ЗаявлениеПатент.Вставить("РедакцияФормы", РедакцияФормыПоУмолчанию);
	
	СоздатьНовоеЗаявление = Неопределено;
	Если Не ПараметрыВыполнения.Свойство("СоздатьНовоеЗаявление", СоздатьНовоеЗаявление)
		Или СоздатьНовоеЗаявление = Ложь Тогда
		
		Отбор = Новый Структура;
		Отбор.Вставить("Организация", Организация);
		Отбор.Вставить("ВидУведомления",
			Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ЗаявлениеНаПолучениеПатентаРекомендованнаяФорма);
		Отбор.Вставить("ИмяФормы", РедакцияФормыПоУмолчанию); // Ранее созданные заявления старых редакций не перезаполняем, создаем новые.
		
		Уведомления = УведомлениеОСпецрежимахНалогообложения.НайтиУведомления(Отбор);
		Уведомления.Сортировать("Дата Убыв, Ссылка Убыв", Новый СравнениеЗначений);
		Если Уведомления.Количество() > 0 Тогда
			ЗаполнитьЗначенияСвойств(ЗаявлениеПатент, Уведомления[0], , "ИмяФормы");
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ЗаявлениеПатент;
	
КонецФункции

// КлассификаторВидовПредпринимательскойДеятельностиПСН
//
// Параметры:
//  ДатаНачалаДействияПатента - Дата - по данному параметру определяется актуальная версия классификатора
//
// Возвращаемое значение:
//  ТаблицаЗначений:
//  * Код - Строка - код по классификатору видов предпринимателькой деятельности ПСН
//  * Наименование - Строка - сокращенное наименование вида деятельности
//  * НаименованиеПолное - Строка - полное наименование вида деятельности
//  * КодТипаТС - Строка - код типа транспортного средства
//  * ЭтоВодныйТранспорт - Булево - признак использования водного транспорта
//  * ЭтоПеревозкаГрузов - Булево - признак связи вида деятельности с грузоперевозками
//  * ЭтоПеревозкаПассажиров - Булево - признак связи вида деятельности с пассажирскими перевозками
//  * УказатьОбъекты - Булево - признак необходимости указать объекты для выбранного вида деятельности
//  * СоответствующиеКодыОКВЭД - СписокЗначений - список кодов ОКВЭД, связанных с данным видом деятельности ПСН
//
Функция КлассификаторВидовПредпринимательскойДеятельностиПСН(ДатаНачалаДействияПатента) Экспорт
	
	Если Не ЗначениеЗаполнено(ДатаНачалаДействияПатента) Тогда
		ДатаПолученияСведений = ОбщегоНазначения.ТекущаяДатаПользователя();
	Иначе
		ДатаПолученияСведений = ДатаНачалаДействияПатента;
	КонецЕсли;
	Если Год(ДатаПолученияСведений) < 2021 Тогда
		ИмяМакета = "КлассификаторВидовПредпринимательскойДеятельностиПСН2020";
	Иначе
		ИмяМакета = "КлассификаторВидовПредпринимательскойДеятельностиПСН";
	КонецЕсли;
	
	Макет = Обработки.ПомощникЗаполненияЗаявленияНаПолучениеПатента.ПолучитьМакет(ИмяМакета);
	
	ТаблицаКлассификатора = ОбщегоНазначения.ЗначениеИзСтрокиXML(Макет.ПолучитьТекст());
	
	// Макет на 2021 год содержит временные коды для патентов, оформляемых при переходе с ЕНВД.
	// Удалим их, если переходный период завершен.
	ПереходныйПериод = УчетУСНПСНКлиентСервер.ПереходныйПериод();
	Если Год(ДатаПолученияСведений) >= 2021 // При добавлении макета на 2022 год заменить на " = 2021"
		И (ДатаПолученияСведений < ПереходныйПериод.Начало Или ПереходныйПериод.Конец < ДатаПолученияСведений) Тогда
		УдалитьВидыДеятельностиПереходногоПериода(ТаблицаКлассификатора);
	КонецЕсли;
	
	Возврат ТаблицаКлассификатора;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает список кодов видов объектов, для которых не требуется указывать площадь.
// Используется для заполнения Листа В в заявлении на получение патента.
//
// Возвращаемое значение:
//  Массив из Строка
//
Функция ВидыОбъектовБезПлощади() Экспорт
	
	ДанныеМакета = Обработки.ПомощникЗаполненияЗаявленияНаПолучениеПатента.ПолучитьМакет(
		"КодыВидовДеятельностиВидаИПризнакаОбъектов");
	КодыВидыОбъектов = ОбщегоНазначения.ЗначениеИзСтрокиXML(ДанныеМакета.ПолучитьТекст());
	
	ОбъектыБезПлощади = Новый СписокЗначений;
	ПустыеПризнаки = КодыВидыОбъектов.НайтиСтроки(Новый Структура("ПризнакОбъекта", ""));
	Для Каждого ТекЗначение Из ПустыеПризнаки Цикл
		Если ОбъектыБезПлощади.НайтиПоЗначению(ТекЗначение.ВидОбъекта) = Неопределено
			// Для вида деятельности с кодом "65" и "94" признак объекта заполняется пользователем вручную,
			// пока ФНС не обновит рекомендуемую форму заявления
			И ТекЗначение.Код <> "65" И ТекЗначение.Код <> "94" Тогда
			ОбъектыБезПлощади.Добавить(ТекЗначение.ВидОбъекта);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ОбъектыБезПлощади;
	
КонецФункции

// Возвращает соответствие между кодом вида деятельности и видом объекта
//
// Возвращаемое значение:
//  Соответствие - в качестве ключа используется код вида деятельности ПСН,
//                 в качестве значения - Массив из Структура:
//                  * Код - Строка
//                  * Наименование - Строка
//                  * ПризнакОбъекта - Строка
//                  * ВидОбъекта - Строка
//
Функция СоответствиеКодовИВидовОбъектов() Экспорт
	
	МакетПСН = Обработки.ПомощникЗаполненияЗаявленияНаПолучениеПатента.ПолучитьМакет("КодыВидовДеятельностиВидаИПризнакаОбъектов");
	СтрокаXML = МакетПСН.ПолучитьТекст();
	Таблица = ОбщегоНазначения.ЗначениеИзСтрокиXML(СтрокаXML);
	ДанныеМакета = ОбщегоНазначения.ТаблицаЗначенийВМассив(Таблица);
	Результат = Новый Соответствие;
	
	Для Каждого РеквизитыОбъекта Из ДанныеМакета Цикл
		Если Результат.Получить(РеквизитыОбъекта.Код) = Неопределено Тогда
			Результат.Вставить(РеквизитыОбъекта.Код, Новый Массив);
		КонецЕсли;
		Результат[РеквизитыОбъекта.Код].Добавить(РеквизитыОбъекта);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращает код вида деятельности ПСН по соответствующему ему коду вида деятельности ОКВЭД2,
// поиск выполняется вначале по полному коду, затем, если код ОКВЭД обозначает подгруппу
// или вид (ХХ.ХХ.Х или ХХ.ХХ.ХХ), то будет произведен поиск по группе, в которую входит указанный
// код ОКВЭД (обозначение группы - XX.XX)
//
// Параметры:
//  КодПоОКВЭД -Строка - код вида деятельности по ОКВЭД2
//  Дата - Дата - поиск идет по классификатору, актуальному для указанной даты
//
// Возвращаемое значение:
//  Строка - код по классификатору видов предпринимателькой деятельности ПСН.
//           Если код не найден, возвращается пустая строка
//
// Пример:
//  КодВидаДеятельностиПСН("62.02.3", '20200101') - вернет "15".
//  КодВидаДеятельностиПСН("62.02.1", '20200101') - вернет "62", поскольку не найден код, соответствующий
//  виду "62.02.1", вернется код соответствующий группе "62.02".
//  В обоих примерах классификатор будет взят из макета "КлассификаторВидовПредпринимательскойДеятельностиПСН2020"
//
Функция КодВидаДеятельностиПСН(КодПоОКВЭД, Дата) Экспорт
	
	Если Не ЗначениеЗаполнено(КодПоОКВЭД) Тогда
		Возврат "";
	КонецЕсли;
	
	Классификатор =
		Обработки.ПомощникЗаполненияЗаявленияНаПолучениеПатента.КлассификаторВидовПредпринимательскойДеятельностиПСН(Дата);
	
	// Поиск при необходимости будет проводится также по коду верхнего уровня,
	// например, если по коду 68.20.1 ничего не найдено, то вернется соответствие для кода 68.20
	Если СтрЧислоВхождений(КодПоОКВЭД, ".") < 2 Тогда
		КодВерхнегоУровня = "";
	Иначе
		ЧастиКода = СтрРазделить(КодПоОКВЭД, ".");
		КодВерхнегоУровня = СтрШаблон("%1.%2", ЧастиКода[0], ЧастиКода[1]);
	КонецЕсли;
	
	КодПСНПоКодуОКВЭДВерхнегоУровня = "";
	
	Для Каждого СтрокаКлассификатора Из Классификатор Цикл
		Если ЗначениеЗаполнено(СтрокаКлассификатора.СоответствующиеКодыОКВЭД) Тогда
			Если СтрокаКлассификатора.СоответствующиеКодыОКВЭД.НайтиПоЗначению(КодПоОКВЭД) <> Неопределено Тогда
				Возврат СтрокаКлассификатора.Код;
			ИначеЕсли ЗначениеЗаполнено(КодВерхнегоУровня) И
				СтрокаКлассификатора.СоответствующиеКодыОКВЭД.НайтиПоЗначению(КодВерхнегоУровня) <> Неопределено Тогда
				КодПСНПоКодуОКВЭДВерхнегоУровня = СтрокаКлассификатора.Код;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат КодПСНПоКодуОКВЭДВерхнегоУровня;
	
КонецФункции

// Возвращает минимально допустимую дату окончания патента для указанной даты начала.
// Проверка переноса срока действия через границу календарного года не производится.
//
// Параметры:
//  ДатаНачала  - Дата - дата начала действия патента.
//
// Возвращаемое значение:
//   Дата   - минимально допустимый день окончания патента.
//
Функция МинимальнаяДатаОкончанияПатента(ДатаНачала) Экспорт
	
	ОдинДень = 24 * 60 * 60;
	
	Возврат ДобавитьМесяц(ДатаНачала, 1) - ОдинДень;
	
КонецФункции

// Возвращает приведенный к секундам срок, установленный законодательством для регистрации физлиц в качестве ИП.
//
// Возвращаемое значение:
//   Число  -  нормативный срок регистрации ИП в секундах.
//
Функция ВремяРегистрацииПредпринимателя() Экспорт
	
	// Срок государственной регистрации ИП - не более 3 рабочих дней
	// (п.3 ст.22.1 Федерального закона от 08.08.2001 N 129-ФЗ)
	
	Возврат 3*24*60*60;
	
КонецФункции

// Преобразует сохраненные данные заявления к актуальному формату.
// Необходимо использовать при повторном открытии формы помощника с сохраненным ранее заявлением.
//
// Параметры:
//   ДанныеЗаявления - Структура - должна содержать поля с именами реквизитов данной обработки.
//
Процедура АктуализироватьФорматСохраняемыхДанных(ДанныеЗаявления) Экспорт
	
	// Заявление всегда формируется по актуальной форме, действующей на день формирования.
	// Если вызывается повторное заполнение заявления, ранее заполненного в предыдущей редакции формы -
	// необходимо привести сохраненные параметры к формату актуального заявления и заполнять новое заявление
	// в актуальной редакции формы.
	
	// В предыдущих формах заявления указывался срок патента и дата начала.
	// Необходимо определить дату окончания, обязательную в текущей форме.
	
	СохраненнаяДатаОкончания = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗаявления, "ДатаОкончания", '00010101');
	СохраненныйСрок = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗаявления, "СрокДействияПатента", 0);
	
	Если Не ЗначениеЗаполнено(СохраненнаяДатаОкончания) И ЗначениеЗаполнено(СохраненныйСрок) Тогда
		
		НачалоОтсчетаСрока = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗаявления, "ДатаНачала", Неопределено);
		Если Не ЗначениеЗаполнено(НачалоОтсчетаСрока) Тогда
			// Если дата начала не заполена, заявление создано при регистрации ИП.
			// В этом случае указывался только срок, отсчет окончания от момента составления заявления - то есть текущего дня.
			НачалоОтсчетаСрока = ТекущаяДатаСеанса() + ВремяРегистрацииПредпринимателя();
		КонецЕсли;
		
		РасчетноеОкончаниеСрока = КонецМесяца(ДобавитьМесяц(НачалоОтсчетаСрока, СохраненныйСрок));
		МинимальноеОкончанияСрока = МинимальнаяДатаОкончанияПатента(НачалоОтсчетаСрока);
		
		// После первичного составления заявления срок окончания и минимальный срок начала могли сдвинуться в следующий год.
		Если Год(МинимальноеОкончанияСрока) > Год(НачалоОтсчетаСрока) Тогда
			// Составляли заявление в конце года - получаем патент на весь следующий год.
			ДанныеЗаявления.Вставить("ДатаОкончания", КонецГода(МинимальноеОкончанияСрока));
		ИначеЕсли Год(РасчетноеОкончаниеСрока) > Год(МинимальноеОкончанияСрока) Тогда
			// Составляли заявление не в конце года, хотели патент до конца года.
			ДанныеЗаявления.Вставить("ДатаОкончания", КонецГода(МинимальноеОкончанияСрока));
		Иначе
			// Составляли заявление не в конце года, хотели патент на несколько месяцев не до конца года.
			ДанныеЗаявления.Вставить("ДатаОкончания", РасчетноеОкончаниеСрока);
		КонецЕсли;
		
		ДанныеЗаявления.Удалить("СрокДействияПатента");
		
	КонецЕсли;
	
КонецПроцедуры

// Возвращает код налоговой инспекции: если заполнены адреса в табличных частях Адреса/Объекты
// и налоговая инспекция по месту осуществления деятельности находится в регионе, отличном от региона регистрации,
// тогда возвращается код первого заполненного адреса, иначе возвращается код по умолчанию.
//
// Параметры:
//   ПараметрыВыполнения - Структура - см. НовыеПараметрыЗаполненияКодНалоговогоОргана()
//   КодНОПоУмолчанию    - Строка - длина 4
//
// Возвращаемое значение:
//   Строка - длина 4
//
Функция КодНалоговогоОрганаПатента(ПараметрыВыполнения, КодНОПоУмолчанию) Экспорт
	
	КодНалоговогоОргана = "";
	
	// Если деятельность осуществляется в регионе регистрации ИП,
	// то заявление подается в налоговый орган по месту регистрации (п. 2 ст. 346.35 НК РФ)
	Если ПустаяСтрока(КодНалоговогоОргана) Или Не ПустаяСтрока(ПараметрыВыполнения.КодНалоговогоОрганаИП)
		И СтрНачинаетсяС(ПараметрыВыполнения.КодНалоговогоОрганаИП, Сред(КодНалоговогоОргана, 1, 2)) Тогда
		
		КодНалоговогоОргана = ПараметрыВыполнения.КодНалоговогоОрганаИП;
		
	КонецЕсли;
	
	Если КодНалоговогоОргана = "" Тогда
		КодНалоговогоОргана = КодНОПоУмолчанию;
	КонецЕсли;
	
	Возврат КодНалоговогоОргана;
	
КонецФункции

// Возвращает структуру с параметрами заполнения кода налогового органа.
//
// Возвращаемое значение:
//   Структура
//
Функция НовыеПараметрыЗаполненияКодНалоговогоОргана() Экспорт
	
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("Адреса", Неопределено);
	ПараметрыЗаполнения.Вставить("Объекты", Неопределено);
	ПараметрыЗаполнения.Вставить("ТранспортныеСредства", Неопределено);
	ПараметрыЗаполнения.Вставить("КодНалоговогоОрганаИП", "");
	
	Возврат ПараметрыЗаполнения;
	
КонецФункции

// Формирует настройки классификатора ПСН и помещает их во временное хранилище, см. НовыеНастройкиКлассификатораПСН
//
// Параметры
//  ДатаНачала - Дата - начало действия патента, по этому параметру определяется актуальная версия классификатора ПСН
//  Ключ - УникальныйИдентификатор - используется для создания временного хранилища
//
// Возвращаемое значение:
//  Строка - адрес временного хранилища
//
Функция АдресНастроекКлассификатора(ДатаНачала, Ключ) Экспорт
	
	ДополнительныеНастройки = НовыеНастройкиКлассификатораПСН();
	ВидыДеятельностиПСН = Новый Массив;
	КодыВидовДеятельностиОбъекты = Новый Массив;
	КодыВидовДеятельностиТС = Новый Массив;
	КодыВидовДеятельностиГрузоперевозки = Новый Массив;
	КодыВодныйТранспорт = Новый Массив;
	КодыТиповТС = Новый Соответствие;
	ЗаголовкиСведенийОбОбъектах = Новый Соответствие;
	
	Классификатор = КлассификаторВидовПредпринимательскойДеятельностиПСН(ДатаНачала);
	Для Каждого СтрокаКлассификатора Из Классификатор Цикл
		РеквизитыВидаДеятельности = Новый Структура;
		РеквизитыВидаДеятельности.Вставить("Код", СтрокаКлассификатора.Код);
		РеквизитыВидаДеятельности.Вставить("Наименование", СтрокаКлассификатора.Наименование);
		ВидыДеятельностиПСН.Добавить(РеквизитыВидаДеятельности);
		Если СтрокаКлассификатора.УказатьОбъекты Тогда
			КодыВидовДеятельностиОбъекты.Добавить(СтрокаКлассификатора.Код);
		КонецЕсли;
		Если СтрокаКлассификатора.ЭтоПеревозкаГрузов Тогда
			КодыВидовДеятельностиТС.Добавить(СтрокаКлассификатора.Код);
			КодыВидовДеятельностиГрузоперевозки.Добавить(СтрокаКлассификатора.Код);
		ИначеЕсли СтрокаКлассификатора.ЭтоПеревозкаПассажиров Тогда
			КодыВидовДеятельностиТС.Добавить(СтрокаКлассификатора.Код);
		КонецЕсли;
		Если СтрокаКлассификатора.ЭтоВодныйТранспорт Тогда
			КодыВодныйТранспорт.Добавить(СтрокаКлассификатора.Код);
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаКлассификатора.КодТипаТС) Тогда
			КодыТиповТС.Вставить(СтрокаКлассификатора.Код, СтрокаКлассификатора.КодТипаТС);
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаКлассификатора.ЗаголовокСведенийОбОбъектах) Тогда
			ЗаголовкиСведенийОбОбъектах.Вставить(СтрокаКлассификатора.Код, СтрокаКлассификатора.ЗаголовокСведенийОбОбъектах);
		КонецЕсли;
		
	КонецЦикла;
	
	ДополнительныеНастройки.ВидыДеятельностиПСН = ВидыДеятельностиПСН;
	ДополнительныеНастройки.КодыВидовДеятельностиОбъекты = КодыВидовДеятельностиОбъекты;
	ДополнительныеНастройки.КодыВидовДеятельностиТС = КодыВидовДеятельностиТС;
	ДополнительныеНастройки.КодыВидовДеятельностиГрузоперевозки = КодыВидовДеятельностиГрузоперевозки;
	ДополнительныеНастройки.КодыВодныйТранспорт = КодыВодныйТранспорт;
	ДополнительныеНастройки.КодыВидыОбъектов =
		Обработки.ПомощникЗаполненияЗаявленияНаПолучениеПатента.СоответствиеКодовИВидовОбъектов();
	ДополнительныеНастройки.КодыТиповТС = КодыТиповТС;
	ДополнительныеНастройки.ЗаголовкиСведенийОбОбъектах = ЗаголовкиСведенийОбОбъектах;
	
	Возврат ПоместитьВоВременноеХранилище(ДополнительныеНастройки, Ключ);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеЛистаТитульнаяСтраница(ПараметрыВыполнения, СведенияОбОрганизации, КодНалоговогоОргана)
	
	СтруктураДанных = Новый Структура;
	
	СтруктураДанных.Вставить("ДатаДок", ПараметрыВыполнения.ДатаСоставления);
	СтруктураДанных.Вставить("ИННШапка",СведенияОбОрганизации.ИННФЛ);
	СтруктураДанных.Вставить("Фамилия", СведенияОбОрганизации.ФамилияИП);
	СтруктураДанных.Вставить("Имя",     СведенияОбОрганизации.ИмяИП);
	СтруктураДанных.Вставить("Отчество",СведенияОбОрганизации.ОтчествоИП);
	СтруктураДанных.Вставить("Тлф",     СведенияОбОрганизации.ТелСлуж);
	СтруктураДанных.Вставить("ОГРНИП",  СведенияОбОрганизации.ОГРН);
	СтруктураДанных.Вставить("КодНО",   КодНалоговогоОргана);
	
	Если ПараметрыВыполнения.Свойство("ДатаНачала") Тогда
		СтруктураДанных.Вставить("ДатаНачПат", ПараметрыВыполнения.ДатаНачала);
	Иначе
		СтруктураДанных.Вставить("ДатаНачПат");
	КонецЕсли;
	
	Если ПараметрыВыполнения.Свойство("ДатаОкончания") Тогда
		СтруктураДанных.Вставить("ДатаКонПат", ПараметрыВыполнения.ДатаОкончания);
	Иначе
		СтруктураДанных.Вставить("ДатаКонПат");
	КонецЕсли;
	
	ДобавитьСведенияОбАдресе(СтруктураДанных, СведенияОбОрганизации.АдрЮР_JSON);
	
	Если ЗначениеЗаполнено(ПараметрыВыполнения.Представитель) Тогда
		СтруктураДанных.Вставить("ФИО_РУКОВОДИТЕЛЯ_ПРЕДСТАВИТЕЛЯ", ПараметрыВыполнения.Представитель);
		СтруктураДанных.Вставить("ПрПодп", "2");
		СтруктураДанных.Вставить("НаимДок", ПараметрыВыполнения.ДокументПредставителя);
	Иначе
		ФИОПредставителя = СтрШаблон("%1 %2 %3",
			СведенияОбОрганизации.ФамилияИП,
			СведенияОбОрганизации.ИмяИП,
			СведенияОбОрганизации.ОтчествоИП);
		СтруктураДанных.Вставить("ФИО_РУКОВОДИТЕЛЯ_ПРЕДСТАВИТЕЛЯ", ФИОПредставителя);
		СтруктураДанных.Вставить("ПрПодп", "1");
		СтруктураДанных.Вставить("НаимДок", "");
	КонецЕсли;
	
	Возврат СтруктураДанных;
	
КонецФункции

Функция ДанныеЛиста2(ПараметрыВыполнения)
	
	СтруктураДанных = Новый Структура;
	
	СтруктураДанных.Вставить("НаимВД", ПараметрыВыполнения.НаименованиеВидаДеятельности);
	
	КодСтрокой = СтрШаблон("%1%2%3",
		ПараметрыВыполнения.КодВидаДеятельности,
		ПараметрыВыполнения.КодРегиона,
		Формат(ПараметрыВыполнения.ПорядковыйНомерВидаДеятельности, "ЧЦ=2; ЧДЦ=0; ЧВН="));
		
	СтруктураДанных.Вставить("КодВД", КодСтрокой);
	
	Если ПараметрыВыполнения.КоличествоСотрудников > 0 Тогда
		СтруктураДанных.Вставить("ПрНаемРаб",  1);
		СтруктураДанных.Вставить("ЧислНаемРаб",ПараметрыВыполнения.КоличествоСотрудников);
	Иначе
		СтруктураДанных.Вставить("ПрНаемРаб",  2);
		СтруктураДанных.Вставить("ЧислНаемРаб",0);
	КонецЕсли;
	
	Если ПараметрыВыполнения.СтавкаНалога < УчетУСНПСНКлиентСервер.НалоговаяСтавкаПоУмолчанию() Тогда
		СтруктураДанных.Вставить("НалСтавка",    ПараметрыВыполнения.СтавкаНалога);
		СтруктураДанных.Вставить("ЗакСубРФСтав", ПараметрыВыполнения.НормаЗакона);
		СтруктураДанных.Вставить("ВыводитьНольНаПечать", Истина);
	Иначе
		СтруктураДанных.Вставить("НалСтавка",    "");
		СтруктураДанных.Вставить("ЗакСубРФСтав", "");
		СтруктураДанных.Вставить("ВыводитьНольНаПечать", Ложь);
	КонецЕсли;
	
	Возврат СтруктураДанных;
	
КонецФункции

Функция ДанныеЛистаА(ПараметрыВыполнения, КодНалоговоОргана)
	
	ДанныеРезультат = Новый Массив; 
	АдресаНеУказаны = ПараметрыВыполнения.Адреса.Количество() = 0;
	
	Если АдресаНеУказаны И ПараметрыВыполнения.ТранспортныеСредства.Количество() = 0
		И ПараметрыВыполнения.Объекты.Количество() = 0 Тогда
		
		СтруктураДанных = Новый Структура;
		СтруктураДанных.Вставить("КодРегион", Лев(КодНалоговоОргана, 2));
		СтруктураДанных.Вставить("КодНОУчет", КодНалоговоОргана);
		СтруктураДанных.Вставить("КодРегионАддр");
		ДанныеРезультат.Добавить(СтруктураДанных);
		
	ИначеЕсли Не АдресаНеУказаны Тогда
		
		Для Каждого ТекСтрока Из ПараметрыВыполнения.Адреса Цикл
			
			СтруктураДанных = Новый Структура;
			ДобавитьСведенияОбАдресе(СтруктураДанных, ТекСтрока.Адрес);
			СтруктураДанных.Вставить("КодНОУчет", "");
			ДанныеРезультат.Добавить(СтруктураДанных);
			
		КонецЦикла;
		
	Иначе
		
		ДанныеРезультат = Новый ТаблицаЗначений;
		
	КонецЕсли;
	
	Возврат ДанныеРезультат;
	
КонецФункции

Функция ДанныеЛистаБ(ПараметрыВыполнения, КодНалоговоОргана, КодНУ)
	
	Если ПараметрыВыполнения.ТранспортныеСредства.Количество() = 0 Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	ДанныеРезультат = Новый Массив;
	
	Возврат ДанныеРезультат;
	
КонецФункции

Функция ДанныеЛистаВ(ПараметрыВыполнения, КодНалоговоОргана, КодНУ)
	
	Если ПараметрыВыполнения.Объекты.Количество() = 0 Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	ДанныеРезультат = Новый Массив;
	
	Возврат ДанныеРезультат;
	
КонецФункции

Процедура ДобавитьЗначениеЛиста(ТекЗначение, ДанныеЗаполнения, ИмяСтраницы, ЛистВДеревере, НомерСтраницы)
	
	ШаблонИмяСтраницы = "Стр. %1";
	УИД = Новый УникальныйИдентификатор;
	ТекЗначение.Вставить("УИД", УИД);
	ДанныеЗаполнения.ДанныеМногостраничныхРазделов[ИмяСтраницы].Добавить(ТекЗначение);
	НоваяСтрока = ЛистВДеревере.Строки.Добавить();
	НоваяСтрока.ИДНаименования = ИмяСтраницы;
	НоваяСтрока.ИмяМакета = ИмяСтраницы;
	НоваяСтрока.ИндексКартинки = 1;
	НоваяСтрока.Многостраничность = Истина;
	НоваяСтрока.Наименование = СтрШаблон(ШаблонИмяСтраницы, НомерСтраницы);
	НоваяСтрока.УИД = УИД;
	
КонецПроцедуры

Процедура ДобавитьСведенияОбАдресе(СтруктураДанных, Адрес)
	
	РоссийскийАдрес = Новый Соответствие;
	РоссийскийАдрес.Вставить("Индекс");
	РоссийскийАдрес.Вставить("КодРегиона");
	РоссийскийАдрес.Вставить("Район");
	РоссийскийАдрес.Вставить("Город");
	РоссийскийАдрес.Вставить("НаселенныйПункт");
	РоссийскийАдрес.Вставить("Улица");
	РоссийскийАдрес.Вставить("Дом");
	РоссийскийАдрес.Вставить("Корпус");
	РоссийскийАдрес.Вставить("Квартира");
	
	РегламентированнаяОтчетностьВызовСервера.СформироватьАдрес(Адрес, РоссийскийАдрес);
	
	СтруктураДанных.Вставить("Индекс",        РоссийскийАдрес["Индекс"]);
	СтруктураДанных.Вставить("КодРегионАддр", РоссийскийАдрес["КодРегиона"]);
	СтруктураДанных.Вставить("КодРегион",     Лев(РоссийскийАдрес["КодРегиона"], 2));
	СтруктураДанных.Вставить("Район",         РоссийскийАдрес["Район"]);
	СтруктураДанных.Вставить("Город",         РоссийскийАдрес["Город"]);
	СтруктураДанных.Вставить("НаселПункт",    РоссийскийАдрес["НаселенныйПункт"]);
	СтруктураДанных.Вставить("Улица",         РоссийскийАдрес["Улица"]);
	СтруктураДанных.Вставить("Дом",           РоссийскийАдрес["Дом"]);
	СтруктураДанных.Вставить("Корпус",        РоссийскийАдрес["Корпус"]);
	СтруктураДанных.Вставить("Кварт",         РоссийскийАдрес["Квартира"]);
	СтруктураДанных.Вставить("АдресXML",      Адрес);
	СтруктураДанных.Вставить("АдресJSON",     Адрес);
	СтруктураДанных.Вставить("Адрес9зпт",     РаботаСАдресами.СведенияОбАдресе(Адрес).Представление);
	
КонецПроцедуры

Функция РедакцияФормыЗаявления(ПолноеИмяФормы)
	
	ПозицияПоследнейТочки = СтрНайти(ПолноеИмяФормы, ".", НаправлениеПоиска.СКонца);
	Возврат Прав(ПолноеИмяФормы, СтрДлина(ПолноеИмяФормы) - ПозицияПоследнейТочки);
	
КонецФункции

Процедура ДополнитьСтруктуруФИОПодписанта(Представитель, ПараметрыЗаявления)
	
	Если ЗначениеЗаполнено(Представитель) Тогда
		ФИО = РегламентированнаяОтчетность.РазложитьФИО(Строка(Представитель));
	Иначе
		ФИО = Новый Структура("Фамилия, Имя, Отчество");
	КонецЕсли;
	
	ПараметрыЗаявления.Вставить("ПодписантФамилия", ФИО.Фамилия);
	ПараметрыЗаявления.Вставить("ПодписантИмя", ФИО.Имя);
	ПараметрыЗаявления.Вставить("ПодписантОтчество", ФИО.Отчество);
	
КонецПроцедуры

Процедура ЗаполнитьДанныеЛистаДерева(ИмяСтраницы, ИмяЛиста, ДанныеЗаполнения, ПараметрыЗаполнения)
	
	ДанныеЗаполнения.ДанныеМногостраничныхРазделов[ИмяСтраницы].Очистить();
	ЛистВДеревере = ДанныеЗаполнения.ДеревоСтраниц.Строки.Найти(ИмяЛиста);
	Если ЛистВДеревере <> Неопределено Тогда
		ЛистВДеревере.Строки.Очистить();
	КонецЕсли;
	
	НомерСтраницы = 1;
	
	Если ПараметрыЗаполнения.Количество() = 0 Тогда
		Области = Отчеты.РегламентированноеУведомлениеПолучениеПатента.ПолучитьМакет(ИмяСтраницы).ПолучитьОбласть("ОсновнаяЧасть").Области;
		ПустаяСтруктура = Новый Структура;
		Для Каждого ТекОбласть Из Области Цикл
			ПустаяСтруктура.Вставить(ТекОбласть.Имя);
		КонецЦикла;
		ПустаяСтруктура.Вставить("КодНОУчет");
		ДобавитьЗначениеЛиста(ПустаяСтруктура, ДанныеЗаполнения, ИмяСтраницы, ЛистВДеревере, НомерСтраницы);
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекЗначение Из ПараметрыЗаполнения Цикл
		
		ДобавитьЗначениеЛиста(ТекЗначение, ДанныеЗаполнения, ИмяСтраницы, ЛистВДеревере, НомерСтраницы);
		НомерСтраницы = НомерСтраницы + 1;
		
	КонецЦикла;
	
КонецПроцедуры

// Возвращает наименование страниц с данными для документа "Уведомление о спецрежимах налогообложения"
//
// Параметры:
//   ИмяФормы  - Строка
//
// Возвращаемое значение:
//   Структура - ключи: Титульная, Лист2, ЛистА, ЛистБ, ЛистВ
//
Функция НаименованиеСтраниц(ИмяФормы)
	
	Страницы = Новый Структура;
	
	Страницы.Вставить("Титульная", СтрШаблон("%1_Титульная", ИмяФормы));
	Страницы.Вставить("Лист2", СтрШаблон("%1_Лист2", ИмяФормы));
	Страницы.Вставить("ЛистА", СтрШаблон("%1_ЛистА", ИмяФормы));
	Страницы.Вставить("ЛистБ", СтрШаблон("%1_ЛистБ", ИмяФормы));
	Страницы.Вставить("ЛистВ", СтрШаблон("%1_ЛистВ", ИмяФормы));
	
	Возврат Страницы;
	
КонецФункции

Процедура ОбновитьТекущийДокумент(ДокументСсылка, ИмяФормы, ПараметрыЗаявления)
	
	НачатьТранзакцию();
	Попытка
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить(ДокументСсылка.Метаданные().ПолноеИмя());
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("Ссылка", ДокументСсылка);
		Блокировка.Заблокировать();
		
		ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
		
		ДанныеЗаполнения = ДокументОбъект.ДанныеУведомления.Получить();
		
		Страницы = НаименованиеСтраниц(ИмяФормы);
		
		ЗаполнитьЗначенияСвойств(ДанныеЗаполнения.ДанныеУведомления[Страницы.Титульная], ПараметрыЗаявления.Стр01);
		ЗаполнитьЗначенияСвойств(ДанныеЗаполнения.ДанныеУведомления[Страницы.Лист2], ПараметрыЗаявления.Стр02);
		ЗаполнитьДанныеЛистаДерева(Страницы.ЛистА, "Листы А", ДанныеЗаполнения, ПараметрыЗаявления.ЛистыА);
		ЗаполнитьДанныеЛистаДерева(Страницы.ЛистБ, "Листы Б", ДанныеЗаполнения, ПараметрыЗаявления.ЛистыБ);
		ЗаполнитьДанныеЛистаДерева(Страницы.ЛистВ, "Листы В", ДанныеЗаполнения, ПараметрыЗаявления.ЛистыВ);
		ДанныеЗаполнения.Вставить("ДанныеПомощникаЗаполнения",ПараметрыЗаявления.ДанныеПомощникаЗаполнения);
		
		ДокументОбъект.ДанныеУведомления = Новый ХранилищеЗначения(ДанныеЗаполнения);
		ДокументОбъект.ДатаПодписи = ПараметрыЗаявления.ДатаСоставления;
		
		ДокументОбъект.ПодписантФамилия  = ПараметрыЗаявления.ПодписантФамилия;
		ДокументОбъект.ПодписантИмя      = ПараметрыЗаявления.ПодписантИмя;
		ДокументОбъект.ПодписантОтчество = ПараметрыЗаявления.ПодписантОтчество;
		ДокументОбъект.РегистрацияВИФНС  = ПараметрыЗаявления.РегистрацияВИФНС;
		
		ДокументОбъект.Записать();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ИмяСобытия = НСтр("ru = 'Формирование заявления на получение патента.'", ОбщегоНазначения.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, ДокументСсылка.Метаданные(), ДокументСсылка, ИнформацияОбОшибке());
	КонецПопытки;
	
КонецПроцедуры

// Возвращает сведения об индивидуальном предпринимателе.
//
// Параметры:
//   Организация     - СправочникСсылка.Организации
//   ДатаСоставления - Дата
//
// Возвращаемое значение:
//   Структура - ключи:
//    - ИНН
//    - ФИО
//    - ТелСлуж
//    - ФамилияИП
//    - ИмяИП
//    - ОтчествоИП
//    - КодНО
//    - ОГРН
//    - АдрЮР_XML
//
Функция СведенияОбИндивидуальномПредпринимателе(Организация, ДатаСоставления)
	
	СтрокаСведений = "ИННФЛ,ФИО,ТелСлуж,ФамилияИП,ИмяИП,ОтчествоИП,КодНО,ОГРН,АдрЮР_XML, АдрЮР_JSON";
	Возврат РегламентированнаяОтчетностьВызовСервера.ПолучитьСведенияОбОрганизации(
		Организация, ДатаСоставления, СтрокаСведений);
	
КонецФункции

Функция НовыеНастройкиКлассификатораПСН()
	
	Настройки = Новый Структура;
	Настройки.Вставить("ВидыДеятельностиПСН", Новый Массив);
	Настройки.Вставить("КодыВидовДеятельностиОбъекты", Новый Массив);
	Настройки.Вставить("КодыВидовДеятельностиТС", Новый Массив);
	Настройки.Вставить("КодыВидовДеятельностиГрузоперевозки", Новый Массив);
	Настройки.Вставить("КодыВодныйТранспорт", Новый Массив);
	Настройки.Вставить("КодыВидыОбъектов", Новый Соответствие);
	Настройки.Вставить("КодыТиповТС", Новый Соответствие);
	Настройки.Вставить("ЗаголовкиСведенийОбОбъектах", Новый Соответствие);
	Возврат Настройки;
	
КонецФункции

Процедура УдалитьВидыДеятельностиПереходногоПериода(ТаблицаКлассификатора)
	
	Для Каждого ВидДеятельности Из УчетУСНПСНКлиентСервер.КодыВидовДеятельностиПереходногоПериода() Цикл
		ПараметрыОтбора = Новый Структура("Код", ВидДеятельности.Ключ);
		Для Каждого НайденнаяСтрока Из ТаблицаКлассификатора.НайтиСтроки(ПараметрыОтбора) Цикл
			ТаблицаКлассификатора.Удалить(НайденнаяСтрока);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
